package com.idc.common.enums;

import lombok.Getter;

/**
 * @Author: jijl
 * @Description: 自定义参数枚举
 * @Date: 2020/7/2 16:54
 **/
@Getter
public enum ResultEnum {


    CODE_1(1, "操作成功！"),
    CODE_2(2, "操作失败！"),
    CODE_3(3, "用户未登陆！"),
    CODE_4(4, "账号或者密码错误！"),
    CODE_5(5, "图像数据为空！"),
    CODE_6(6, "图像数据传输异常！"),
    CODE_7(7, "图片上传大小不能超过5M！"),
    CODE_8(8, "图片上传格式错误！"),
    CODE_9(9, "该账号已被冻结！"),
    CODE_10(10, "登录凭证已过期！"),
    CODE_14(14, "用户名错误！"),
    CODE_15(15, "密码错误！"),
    CODE_16(16, "请求短信类型不能为空！"),
    CODE_17(17, "验证码发送失败！"),
    CODE_18(18, "地址信息不存在！"),
    CODE_19(19, "昵称不能为空！"),
    CODE_20(20, "微信授权失败！"),
    CODE_21(21, "权限不足！"),
    CODE_22(22, "当前权限下面有子权限,不能修改"),
    CODE_23(23, "当前权限有角色绑定,不能删除"),

    CODE_24(24, "该用户未保存品牌基础信息"),

    CODE_100(100, "设备不存在"),
    CODE_101(101, "设备故障中"),
    CODE_102(102, "设备不在线"),
    CODE_103(103, "设备已禁用"),
    CODE_104(104, "该设备未绑定门店"),
    CODE_105(105, "套餐不存在"),
    CODE_106(106, "该设备未绑定门店,无法正常使用"),
    CODE_107(107, "订单号不存在"),
    CODE_108(108, "订单已支付请勿重复提交"),
    CODE_109(109, "对不起，该门店已禁入"),
    CODE_111(111, "申请正在审核中,请勿重复提交"),
    CODE_112(112, "申请已通过,请勿重复提交"),
    CODE_113(113, "没有开门权限!"),
    CODE_114(114, "当前模式无法开关灯!"),
    CODE_115(115, "二维码或设备编号必须传其一!"),
    CODE_116(116, "未发现任何操作!"),
    CODE_117(117, "灯已关闭，请勿重复操作!"),
    CODE_118(118, "灯已开启，请勿重复操作!"),
    CODE_119(119, "操作状态错误!"),
    CODE_120(120, "操作模式重复!"),
    CODE_121(121, "白天模式无须扫码!"),
    CODE_122(122, "执行结果等待中!"),
    CODE_200(200, "操作成功！"),
    CODE_201(201, "二维码保存失败！"),
    CODE_202(202, "套餐最大数量为10个！"),
    CODE_203(203, "设备唯一码重复！"),
    CODE_204(204, "导入失败！"),
    CODE_205(205, "该医院不存在！"),
    CODE_206(206, "该手机号已存在！"),
    CODE_207(207, "该订单未支付！无法退款"),
    CODE_208(208, "退款失败！"),
    CODE_209(209, "分成比例设置错误！"),
    CODE_210(210, "不存在该参数！"),
    CODE_211(211, "套餐金额不能为空或小于1分钟！"),
    CODE_212(212, "该设备正在使用中，无法结束订单！"),
    CODE_213(213, "该设备非故障，无法退款！"),
    CODE_214(214, "门店编号不能为空！"),
    CODE_215(215, "该门店已绑定设备！"),
    CODE_216(216, "非禁用且正常的设备才支持远程开门！"),
    CODE_400(400, ""),

    CODE_401(401, "账号或者密码错误！"),

    CODE_403(403, "没有获取授权！"),

    CODE_404(404, "找不到该路径！"),

    CODE_405(405, "请求方式错误！"),

    CODE_406(406, "Not Acceptable"),

    CODE_415(415, "请求参数格式错误！"),

    CODE_500(500, "服务器出错了，请联系后台开发人员！"),

    CODE_1001(1001, "获取短信验证码失败！"),

    CODE_1002(1002, "服务器数据异常！"),

    CODE_1003(1003, "Payment failed"),

    CODE_1004(1004, "Refund failed"),

    CODE_1005(1005, "开锁命令错误！"),

    CODE_1006(1006, "开锁失败！"),

    CODE_1007(1007, "设备不在线！"),

    CODE_1008(1008, "设备响应超时！"),

    CODE_1015(1015, "缓存服务器连接失败！"),

    CODE_1016(1016, "无法识的二维码！"),

    CODE_9999(9999, "服务器无法处理请求！");

    private Integer code;

    private String msg;

    ResultEnum(Integer code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}
